{
  "job": "DevOps Engineer and Full stack Developer",
  "expertise": "Expertise",
  "experience": "Experience",
  "projects": "Projects",
  "contact": "Contact",
  "profile": "Profile",
  "bio": "DevOps Engineer and Lead Developer, I have 3 years of experience in full-stack development, automation, CI/CD, and infrastructure management. Specializing in Kubernetes, Docker, and AWS Cloud, I am involved throughout the entire project lifecycle, from development to system administration, including DevOps and team management using agile methodology. Passionate about technical challenges, I enjoy proposing innovative solutions to optimize infrastructures and improve the scalability of applications. My holistic approach combines technical expertise and managerial skills to ensure high-performance and efficient projects.",
  "expertise.fullstack.title": "Full Stack Development",
  "expertise.fullstack.description": "I have built multiple applications from scratch using modern technologies such as React, Nestjs, Java, Springboot, Angular. I have a strong proficiency in writing clean and robust code with best practices",
  "expertise.devops.title": "Cloud & DevOps & Automation",
  "expertise.devops.description": "Once the application is built, I help clients set up DevOps testing, CI/CD pipelines, and deployment automation to ensure a successful Go-Live. I am a Certified Kubernetes Administrator (CKA), so I can deploy applications on a Kubernetes cluster and manage it.",
  "expertise.data.title": "AI & Data",
  "expertise.data.description": "I can build and develop AI models using Machine Learning (ML) and Deep Learning (DL). I have a solid background in data engineering with Hadoop and Spark.",
  "experience.primezone.title": "Front-End Developer Internship",
  "experience.primezone.subTitle": "Prime Zone Systems",
  "experience.primezone.description": "Development of an embedded web application integrating the NavVis IVION API to display a 3D scan of a building and manage equipment, cameras, and sensors. Back-end in Node.js (Express.js) with MySQL, front-end in React, Redux, and Material-UI. Set up an MQTT broker to receive IoT data and a WebSocket for real-time display.",
  "experience.fraisy.title": "Mobile Development - Full Stack",
  "experience.fraisy.subTitle": "Fraisy / Freelance",
  "experience.fraisy.description": "Mobile delivery application (Android & iOS) with React Native and Node.js, allowing customers to place orders and track their deliveries. Interface for delivery drivers to manage orders. Admin panel for managing products, customers, and drivers.",
  "experience.apitech.dev.title": "Full Stack Developer",
  "experience.apitech.dev.subTitle": "Apitech",
  "experience.apitech.dev.description": "Automation of communication system deployment on Kubernetes with a REST API in NestJS to manage infrastructure (Terraform, Kubernetes), the kubernetes-client library to manage resources, and an admin panel in Angular. Full system containerization with Docker and integration of Google Calendar API for event management.",
  "experience.apitech.leadDev.title": "Lead Developer",
  "experience.apitech.leadDev.subTitle": "Apitech",
  "experience.apitech.leadDev.description": "Automation of communication system deployment on Kubernetes, including design and problem-solving, pull request validation to ensure code quality, and organization and facilitation of weekly meetings and daily stand-ups to track team progress.",
  "experience.apitech.manager.title": "Project Manager and Technical Architect",
  "experience.apitech.manager.subTitle": "Apitech",
  "experience.apitech.manager.description": "Project management, client support for complex issues, and definition of commercialization strategy and project roadmap.",
  "projects.section.title": "Personal Projects",
  "projects.medlab.name": "Med Laboratory",
  "projects.medlab.description": "A project built from scratch where I applied many concepts (Design, CI/CD, Web server, nginx, Docker, Github Actions, Jenkins)",
  "projects.archive.name": "Open Source Archive",
  "projects.archive.description": "(Username: G138473665, Password: G138473665) A project built with Next.js, Node.js, Google Firebase, MongoDB. It's a platform I built for my college colleagues to help them access lessons, exams, etc. Also, an administration space to add and delete documents.",
  "projects.formation.name": "Open Source Archive",
  "projects.formation.description": "A project built with Next.js and MySQL. It has a landing page for new students and an inscription page with an admin space.",
  "contactMe": "Contact Me",
  "sendMailButtonText": "SEND",
  "firstNameErrorMessage": "Please enter your first name",
  "lastNameErrorMessage": "Please enter your last name",
  "mailErrorMessage": "Please enter a valid email",
  "phoneErrorMessage": "Please enter a valid phone number (e.g. 0699999999 or +33799999999)",
  "messageErrorMessage": "Please enter the message",
  "firstName": "First Name",
  "lastName": "Last Name",
  "sendMailSucessMessage": "Email sent successfully",
  "sendMailFailMessage": "Something went wrong, please try again later !",
  "resume": "Resume"
}
