{
  "job": "Ingénieur DevOps et Développeur Full stack",
  "expertise": "Expertise",
  "experience": "Expérience",
  "projects": "Projets",
  "contact": "Contact",
  "profile": "Profile",
  "bio": "Ingénieur DevOps et Lead Développeur, j’ai 3 ans d’expérience en Développement full stack, automatisation, CI/CD et gestion d’infrastructure. Spécialisé en Kubernetes, Docker et Cloud AWS, j’interviens sur l’ensemble du cycle de vie des projets, du développement à l’administration système, en passant par le DevOps et la gestion d’équipe en méthodologie agile. Passionné par les défis techniques, j’aime proposer des solutions innovantes pour optimiser les infrastructures et améliorer la scalabilité des applications. Mon approche globale allie expertise technique et compétences managériales pour garantir des projets performants et efficaces.",
  "expertise.fullstack.title": "Développement Full Stack",
  "expertise.fullstack.description": "J'ai construit de multiples applications à partir de zéro en utilisant des technologies modernes telles que React, Nestjs, Java, Springboot, Angular. J'ai une forte compétence dans l'écriture de code propre et robuste avec les meilleures pratiques.",
  "expertise.devops.title": "Cloud & DevOps & automatisation",
  "expertise.devops.description": "Une fois l'application construite, j'aide les clients à mettre en place des tests DevOps, des pipelines CI/CD et l'automatisation du déploiement pour assurer un Go-Live réussi. Je suis un administrateur Kubernetes certifié (CKA), je peux donc déployer des applications sur un cluster Kubernetes et le gérer.",
  "expertise.data.title": "AI & Data",
  "expertise.data.description": "Je peux concevoir et développer des modèles d'IA en utilisant le Machine Learning (ML) et le Deep Learning (DL). J'ai une solide expertise en ingénierie des données avec Hadoop et Spark.",
  "experience.primezone.title": "Alternance Développeur Front-End",
  "experience.primezone.subTitle": "Prime Zone Systemes",
  "experience.primezone.description": "Développement d'une application web embarquée intégrant l'API NavVis IVION pour afficher un scan 3D d'un bâtiment et gérer les équipements, caméras et capteurs. Back-end en Node.js (Express.js) avec MySQL, front-end en React, Redux et Material-UI. Mise en place d'un MQTT broker pour recevoir les données IoT et d'un WebSocket pour l'affichage en temps réel.",
  "experience.fraisy.title": "Développement mobile - full stack",
  "experience.fraisy.subTitle": "Fraisy / Freelance ",
  "experience.fraisy.description": "Application mobile de livraison (Android & iOS) avec React Native et Node.js, permettant aux clients de commander et suivre leurs livraisons. Interface dédiée aux livreurs pour la gestion des commandes. Admin panel pour la gestion des produits, clients et livreurs.",
  "experience.apitech.dev.title": "Développeur Full stack",
  "experience.apitech.dev.subTitle": "Apitech",
  "experience.apitech.dev.description": "Automatisation du déploiement d’un système de communication sur Kubernetes avec une API REST en NestJS pour gérer l’infrastructure (Terraform, Kubernetes), la librairie kubernetes-client pour administrer les ressources, et un admin panel en Angular. Containerisation complète avec Docker et intégration de Google Calendar API pour la gestion des événements.",
  "experience.apitech.leadDev.title": "Lead Dev",
  "experience.apitech.leadDev.subTitle": "Apitech",
  "experience.apitech.leadDev.description": "Automatisation du déploiement d’un système de communication sur Kubernetes, incluant la conception et la résolution de problèmes, la validation des pull requests pour assurer la qualité du code, ainsi que l'organisation et l'animation des réunions hebdomadaires et daily meetings pour suivre l’avancement de l’équipe.",
  "experience.apitech.manager.title": "Chef de projet et architecte technique",
  "experience.apitech.manager.subTitle": "Apitech",
  "experience.apitech.manager.description": "Gestion de projet, support client pour les sujets complexes, et définition de la stratégie de commercialisation ainsi que de la feuille de route du projet.",
  "projects.section.title": "Projets Personnels",
  "projects.medlab.name": "Laboratoire Médical",
  "projects.medlab.description": "Un projet construit de A à Z où j'ai appliqué de nombreux concepts (Design, CI/CD, Serveur Web, nginx, Docker, Github Actions, Jenkins)",
  "projects.archive.name": "Archive Open Source",
  "projects.archive.description": "(Nom d'utilisateur : G138473665, Mot de passe : G138473665) Un projet construit avec Next.js, Node.js, Google Firebase, MongoDB. C'est une plateforme que j'ai créée pour mes collègues de collège afin de les aider à accéder aux cours, examens, etc. Il y a également un espace d'administration pour ajouter et supprimer des documents.",
  "projects.formation.name": "Archive Open Source",
  "projects.formation.description": "Un projet construit avec Next.js et MySQL. Il dispose d'une page d'accueil pour les nouveaux étudiants et d'une page d'inscription avec un espace d'administration.",
  "contactMe": "Contactez Moi",
  "sendMailButtonText": "ENVOYER",
  "firstNameErrorMessage": "Veuillez entrer votre prénom",
  "lastNameErrorMessage": "Veuillez entrer votre nom",
  "mailErrorMessage": "Veuillez entrer une adresse e-mail valide",
  "phoneErrorMessage": "Veuillez entrer un numéro de téléphone valide (ex : 0699999999 ou +33799999999)",
  "messageErrorMessage": "Veuillez entrer le message",
  "firstName": "Prénom",
  "lastName": "Nom",
  "sendMailSucessMessage": "E-mail envoyé avec succès",
  "sendMailFailMessage": "Une erreur s'est produite, veuillez réessayer plus tard !",
  "resume": "Cv"
}
